**1. Read and import data**

In [16]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

from sklearn.linear_model import LinearRegression
from sklearn.model_selection import train_test_split
from sklearn.metrics import mean_squared_error

In [17]:
dataset = pd.read_csv('./data/salary.csv', sep='|')

In [18]:
dataset.head(2)

,id,job_title,location,salary_currency,career_level,experience_level,education_level,employment_type,job_function,job_benefits,company_process_time,company_size,company_industry,job_description,salary
0,1,Facility Maintenance & Smart Warehouse Manager,Bandung,IDR,Manajer/Asisten Manajer,5 tahun,"Sertifikat Professional, D3 (Diploma), D4 (Dip...",Penuh Waktu,"Manufaktur,Pemeliharaan",NaN,NaN,NaN,NaN,Deskripsi PekerjaanRequirements :D3/SI from re...,NaN
1,2,Procurement Department Head,Jakarta Raya,IDR,Manajer/Asisten Manajer,5 tahun,"Sarjana (S1), Diploma Pascasarjana, Gelar Prof...",Penuh Waktu,"Manufaktur,Pembelian/Manajemen Material",NaN,25 days,51 - 200 pekerja,Manajemen/Konsulting HR,Job Role: 1. Responsible for material availabi...,NaN

**2. Cleaning the data**

In [19]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 34746 entries, 0 to 34745
Data columns (total 15 columns):
id                      34746 non-null int64
job_title               34746 non-null object
location                34746 non-null object
salary_currency         34742 non-null object
career_level            34746 non-null object
experience_level        30205 non-null object
education_level         34746 non-null object
employment_type         33402 non-null object
job_function            34746 non-null object
job_benefits            27330 non-null object
company_process_time    24555 non-null object
company_size            29103 non-null object
company_industry        33132 non-null object
job_description         34745 non-null object
salary                  9352 non-null float64
dtypes: float64(1), int64(1), object(13)
memory usage: 4.0+ MB

In [20]:
# Remove Column 
dataset = dataset.drop(labels=["id", "salary_currency", "job_benefits", "job_function", "job_description",
"company_process_time", "company_size", "company_industry", "employment_type"], axis=1)

In [21]:
# Mengisi data experience_level yang nan atau null dengan mean

In [22]:
# Convert str => int
dataset["experience_level"] = dataset["experience_level"].str.replace("\D", "").fillna(0).astype('int')

In [37]:
# Mengisi data salary yang nan atau null dengan median
dataset["job_title"] = dataset["job_title"].str.lower()
# dataset['salary'] = dataset['salary'].fillna((dataset["salary"].median()))

In [24]:
print(dataset["job_title"].unique())

['facility maintenance & smart warehouse manager'
 'procurement department head' 'sales admin' ...
 'head of subdivision (english speaking) bandung' 'receiving staff'
 'credit marketing officer (cmo) - tangerang & cikupa']

In [25]:
dataset["job_title"].duplicated().sum()

15131

In [26]:
dataset.shape

(34746, 6)

In [32]:
# Check null values
dataset.isnull().sum()

job_title           0
location            0
career_level        0
experience_level    0
education_level     0
salary              0
dtype: int64

In [33]:
dataset.head(2)

,job_title,location,career_level,experience_level,education_level,salary
0,facility maintenance & smart warehouse manager,Bandung,Manajer/Asisten Manajer,5,"Sertifikat Professional, D3 (Diploma), D4 (Dip...",5500000.0
1,procurement department head,Jakarta Raya,Manajer/Asisten Manajer,5,"Sarjana (S1), Diploma Pascasarjana, Gelar Prof...",5500000.0

In [29]:
# Nampilin tipe kolom "Object" & "Number"
objectType  = dataset.select_dtypes(['object']).columns
numericType  = dataset.select_dtypes(['number']).columns
print(objectType)
print(numericType)

Index(['job_title', 'location', 'career_level', 'education_level'], dtype='object')
Index(['experience_level', 'salary'], dtype='object')

In [34]:
dataset[numericType].describe()

       experience_level        salary
count      34746.000000  3.474600e+04
mean           2.161659  6.000324e+06
std            1.947719  1.117451e+07
min            0.000000  1.000000e+01
25%            1.000000  5.500000e+06
50%            2.000000  5.500000e+06
75%            3.000000  5.500000e+06
max           20.000000  2.000000e+09

**3. Discovering the data**

**4. Predict the salary**